handali/k6-tests/test-handbook/before-result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test-handbook.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 3m20s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 2m50s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 001/100 VUs  0m01.0s/2m50.0s

running (0m02.0s), 001/100 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 001/100 VUs  0m02.0s/2m50.0s

running (0m03.0s), 002/100 VUs, 2 complete and 0 interrupted iterations
default   [   2% ] 002/100 VUs  0m03.0s/2m50.0s

running (0m04.0s), 002/100 VUs, 4 complete and 0 interrupted iterations
default   [   2% ] 002/100 VUs  0m04.0s/2m50.0s

running (0m05.0s), 003/100 VUs, 6 complete and 0 interrupted iterations
default   [   3% ] 003/100 VUs  0m05.0s/2m50.0s

running (0m06.0s), 003/100 VUs, 9 complete and 0 interrupted iterations
default   [   4% ] 003/100 VUs  0m06.0s/2m50.0s

running (0m07.0s), 004/100 VUs, 12 complete and 0 interrupted iterations
default   [   4% ] 004/100 VUs  0m07.0s/2m50.0s

running (0m08.0s), 004/100 VUs, 16 complete and 0 interrupted iterations
default   [   5% ] 004/100 VUs  0m08.0s/2m50.0s

running (0m09.0s), 005/100 VUs, 20 complete and 0 interrupted iterations
default   [   5% ] 005/100 VUs  0m09.0s/2m50.0s

running (0m10.0s), 005/100 VUs, 25 complete and 0 interrupted iterations
default   [   6% ] 005/100 VUs  0m10.0s/2m50.0s

running (0m11.0s), 005/100 VUs, 29 complete and 0 interrupted iterations
default   [   6% ] 005/100 VUs  0m11.0s/2m50.0s

running (0m12.0s), 006/100 VUs, 34 complete and 0 interrupted iterations
default   [   7% ] 006/100 VUs  0m12.0s/2m50.0s

running (0m13.0s), 006/100 VUs, 36 complete and 0 interrupted iterations
default   [   8% ] 006/100 VUs  0m13.0s/2m50.0s

running (0m14.0s), 007/100 VUs, 42 complete and 0 interrupted iterations
default   [   8% ] 007/100 VUs  0m14.0s/2m50.0s

running (0m15.0s), 007/100 VUs, 49 complete and 0 interrupted iterations
default   [   9% ] 007/100 VUs  0m15.0s/2m50.0s

running (0m16.0s), 008/100 VUs, 56 complete and 0 interrupted iterations
default   [   9% ] 008/100 VUs  0m16.0s/2m50.0s

running (0m17.0s), 008/100 VUs, 64 complete and 0 interrupted iterations
default   [  10% ] 008/100 VUs  0m17.0s/2m50.0s

running (0m18.0s), 009/100 VUs, 72 complete and 0 interrupted iterations
default   [  11% ] 009/100 VUs  0m18.0s/2m50.0s

running (0m19.0s), 009/100 VUs, 81 complete and 0 interrupted iterations
default   [  11% ] 009/100 VUs  0m19.0s/2m50.0s

running (0m20.0s), 009/100 VUs, 90 complete and 0 interrupted iterations
default   [  12% ] 009/100 VUs  0m20.0s/2m50.0s

running (0m21.0s), 010/100 VUs, 99 complete and 0 interrupted iterations
default   [  12% ] 010/100 VUs  0m21.0s/2m50.0s

running (0m22.0s), 010/100 VUs, 109 complete and 0 interrupted iterations
default   [  13% ] 010/100 VUs  0m22.0s/2m50.0s

running (0m23.0s), 010/100 VUs, 118 complete and 0 interrupted iterations
default   [  14% ] 010/100 VUs  0m23.0s/2m50.0s

running (0m24.0s), 010/100 VUs, 128 complete and 0 interrupted iterations
default   [  14% ] 010/100 VUs  0m24.0s/2m50.0s

running (0m25.0s), 010/100 VUs, 138 complete and 0 interrupted iterations
default   [  15% ] 010/100 VUs  0m25.0s/2m50.0s

running (0m26.0s), 010/100 VUs, 147 complete and 0 interrupted iterations
default   [  15% ] 010/100 VUs  0m26.0s/2m50.0s

running (0m27.0s), 010/100 VUs, 157 complete and 0 interrupted iterations
default   [  16% ] 010/100 VUs  0m27.0s/2m50.0s

running (0m28.0s), 010/100 VUs, 166 complete and 0 interrupted iterations
default   [  16% ] 010/100 VUs  0m28.0s/2m50.0s

running (0m29.0s), 010/100 VUs, 170 complete and 0 interrupted iterations
default   [  17% ] 010/100 VUs  0m29.0s/2m50.0s

running (0m30.0s), 010/100 VUs, 180 complete and 0 interrupted iterations
default   [  18% ] 010/100 VUs  0m30.0s/2m50.0s

running (0m31.0s), 010/100 VUs, 190 complete and 0 interrupted iterations
default   [  18% ] 010/100 VUs  0m31.0s/2m50.0s

running (0m32.0s), 010/100 VUs, 200 complete and 0 interrupted iterations
default   [  19% ] 010/100 VUs  0m32.0s/2m50.0s

running (0m33.0s), 010/100 VUs, 210 complete and 0 interrupted iterations
default   [  19% ] 010/100 VUs  0m33.0s/2m50.0s

running (0m34.0s), 010/100 VUs, 220 complete and 0 interrupted iterations
default   [  20% ] 010/100 VUs  0m34.0s/2m50.0s

running (0m35.0s), 010/100 VUs, 230 complete and 0 interrupted iterations
default   [  21% ] 010/100 VUs  0m35.0s/2m50.0s

running (0m36.0s), 010/100 VUs, 240 complete and 0 interrupted iterations
default   [  21% ] 010/100 VUs  0m36.0s/2m50.0s

running (0m37.0s), 010/100 VUs, 250 complete and 0 interrupted iterations
default   [  22% ] 010/100 VUs  0m37.0s/2m50.0s

running (0m38.0s), 010/100 VUs, 260 complete and 0 interrupted iterations
default   [  22% ] 010/100 VUs  0m38.0s/2m50.0s

running (0m39.0s), 010/100 VUs, 270 complete and 0 interrupted iterations
default   [  23% ] 010/100 VUs  0m39.0s/2m50.0s

running (0m40.0s), 010/100 VUs, 280 complete and 0 interrupted iterations
default   [  24% ] 010/100 VUs  0m40.0s/2m50.0s

running (0m41.0s), 010/100 VUs, 290 complete and 0 interrupted iterations
default   [  24% ] 010/100 VUs  0m41.0s/2m50.0s

running (0m42.0s), 010/100 VUs, 300 complete and 0 interrupted iterations
default   [  25% ] 010/100 VUs  0m42.0s/2m50.0s

running (0m43.0s), 010/100 VUs, 310 complete and 0 interrupted iterations
default   [  25% ] 010/100 VUs  0m43.0s/2m50.0s

running (0m44.0s), 010/100 VUs, 310 complete and 0 interrupted iterations
default   [  26% ] 010/100 VUs  0m44.0s/2m50.0s

running (0m45.0s), 010/100 VUs, 320 complete and 0 interrupted iterations
default   [  26% ] 010/100 VUs  0m45.0s/2m50.0s

running (0m46.0s), 010/100 VUs, 330 complete and 0 interrupted iterations
default   [  27% ] 010/100 VUs  0m46.0s/2m50.0s

running (0m47.0s), 010/100 VUs, 340 complete and 0 interrupted iterations
default   [  28% ] 010/100 VUs  0m47.0s/2m50.0s

running (0m48.0s), 010/100 VUs, 350 complete and 0 interrupted iterations
default   [  28% ] 010/100 VUs  0m48.0s/2m50.0s

running (0m49.0s), 010/100 VUs, 360 complete and 0 interrupted iterations
default   [  29% ] 010/100 VUs  0m49.0s/2m50.0s

running (0m50.0s), 010/100 VUs, 370 complete and 0 interrupted iterations
default   [  29% ] 010/100 VUs  0m50.0s/2m50.0s

running (0m51.0s), 011/100 VUs, 380 complete and 0 interrupted iterations
default   [  30% ] 011/100 VUs  0m51.0s/2m50.0s

running (0m52.0s), 013/100 VUs, 391 complete and 0 interrupted iterations
default   [  31% ] 013/100 VUs  0m52.0s/2m50.0s

running (0m53.0s), 015/100 VUs, 404 complete and 0 interrupted iterations
default   [  31% ] 015/100 VUs  0m53.0s/2m50.0s

running (0m54.0s), 017/100 VUs, 419 complete and 0 interrupted iterations
default   [  32% ] 017/100 VUs  0m54.0s/2m50.0s

running (0m55.0s), 019/100 VUs, 436 complete and 0 interrupted iterations
default   [  32% ] 019/100 VUs  0m55.0s/2m50.0s

running (0m56.0s), 021/100 VUs, 455 complete and 0 interrupted iterations
default   [  33% ] 021/100 VUs  0m56.0s/2m50.0s

running (0m57.0s), 023/100 VUs, 476 complete and 0 interrupted iterations
default   [  34% ] 023/100 VUs  0m57.0s/2m50.0s

running (0m58.0s), 025/100 VUs, 499 complete and 0 interrupted iterations
default   [  34% ] 025/100 VUs  0m58.0s/2m50.0s

running (0m59.0s), 027/100 VUs, 524 complete and 0 interrupted iterations
default   [  35% ] 027/100 VUs  0m59.0s/2m50.0s

running (1m00.0s), 029/100 VUs, 540 complete and 0 interrupted iterations
default   [  35% ] 029/100 VUs  1m00.0s/2m50.0s

running (1m01.0s), 031/100 VUs, 568 complete and 0 interrupted iterations
default   [  36% ] 031/100 VUs  1m01.0s/2m50.0s

running (1m02.0s), 033/100 VUs, 599 complete and 0 interrupted iterations
default   [  36% ] 033/100 VUs  1m02.0s/2m50.0s

running (1m03.0s), 035/100 VUs, 632 complete and 0 interrupted iterations
default   [  37% ] 035/100 VUs  1m03.0s/2m50.0s

running (1m04.0s), 037/100 VUs, 667 complete and 0 interrupted iterations
default   [  38% ] 037/100 VUs  1m04.0s/2m50.0s

running (1m05.0s), 039/100 VUs, 704 complete and 0 interrupted iterations
default   [  38% ] 039/100 VUs  1m05.0s/2m50.0s

running (1m06.0s), 041/100 VUs, 743 complete and 0 interrupted iterations
default   [  39% ] 041/100 VUs  1m06.0s/2m50.0s

running (1m07.0s), 043/100 VUs, 784 complete and 0 interrupted iterations
default   [  39% ] 043/100 VUs  1m07.0s/2m50.0s

running (1m08.0s), 045/100 VUs, 826 complete and 0 interrupted iterations
default   [  40% ] 045/100 VUs  1m08.0s/2m50.0s

running (1m09.0s), 047/100 VUs, 870 complete and 0 interrupted iterations
default   [  41% ] 047/100 VUs  1m09.0s/2m50.0s

running (1m10.0s), 049/100 VUs, 916 complete and 0 interrupted iterations
default   [  41% ] 049/100 VUs  1m10.0s/2m50.0s

running (1m11.0s), 050/100 VUs, 965 complete and 0 interrupted iterations
default   [  42% ] 050/100 VUs  1m11.0s/2m50.0s

running (1m12.0s), 050/100 VUs, 1013 complete and 0 interrupted iterations
default   [  42% ] 050/100 VUs  1m12.0s/2m50.0s

running (1m13.0s), 050/100 VUs, 1062 complete and 0 interrupted iterations
default   [  43% ] 050/100 VUs  1m13.0s/2m50.0s

running (1m14.0s), 050/100 VUs, 1111 complete and 0 interrupted iterations
default   [  44% ] 050/100 VUs  1m14.0s/2m50.0s

running (1m15.0s), 050/100 VUs, 1161 complete and 0 interrupted iterations
default   [  44% ] 050/100 VUs  1m15.0s/2m50.0s

running (1m16.0s), 050/100 VUs, 1205 complete and 0 interrupted iterations
default   [  45% ] 050/100 VUs  1m16.0s/2m50.0s

running (1m17.0s), 050/100 VUs, 1240 complete and 0 interrupted iterations
default   [  45% ] 050/100 VUs  1m17.0s/2m50.0s

running (1m18.0s), 050/100 VUs, 1280 complete and 0 interrupted iterations
default   [  46% ] 050/100 VUs  1m18.0s/2m50.0s

running (1m19.0s), 050/100 VUs, 1330 complete and 0 interrupted iterations
default   [  46% ] 050/100 VUs  1m19.0s/2m50.0s

running (1m20.0s), 050/100 VUs, 1380 complete and 0 interrupted iterations
default   [  47% ] 050/100 VUs  1m20.0s/2m50.0s

running (1m21.0s), 050/100 VUs, 1430 complete and 0 interrupted iterations
default   [  48% ] 050/100 VUs  1m21.0s/2m50.0s

running (1m22.0s), 050/100 VUs, 1480 complete and 0 interrupted iterations
default   [  48% ] 050/100 VUs  1m22.0s/2m50.0s

running (1m23.0s), 050/100 VUs, 1530 complete and 0 interrupted iterations
default   [  49% ] 050/100 VUs  1m23.0s/2m50.0s

running (1m24.0s), 050/100 VUs, 1580 complete and 0 interrupted iterations
default   [  49% ] 050/100 VUs  1m24.0s/2m50.0s

running (1m25.0s), 050/100 VUs, 1630 complete and 0 interrupted iterations
default   [  50% ] 050/100 VUs  1m25.0s/2m50.0s

running (1m26.0s), 050/100 VUs, 1680 complete and 0 interrupted iterations
default   [  51% ] 050/100 VUs  1m26.0s/2m50.0s

running (1m27.0s), 050/100 VUs, 1730 complete and 0 interrupted iterations
default   [  51% ] 050/100 VUs  1m27.0s/2m50.0s

running (1m28.0s), 050/100 VUs, 1780 complete and 0 interrupted iterations
default   [  52% ] 050/100 VUs  1m28.0s/2m50.0s

running (1m29.0s), 050/100 VUs, 1820 complete and 0 interrupted iterations
default   [  52% ] 050/100 VUs  1m29.0s/2m50.0s

running (1m30.0s), 050/100 VUs, 1857 complete and 0 interrupted iterations
default   [  53% ] 050/100 VUs  1m30.0s/2m50.0s

running (1m31.0s), 050/100 VUs, 1890 complete and 0 interrupted iterations
default   [  54% ] 050/100 VUs  1m31.0s/2m50.0s

running (1m32.0s), 050/100 VUs, 1930 complete and 0 interrupted iterations
default   [  54% ] 050/100 VUs  1m32.0s/2m50.0s

running (1m33.0s), 050/100 VUs, 1980 complete and 0 interrupted iterations
default   [  55% ] 050/100 VUs  1m33.0s/2m50.0s

running (1m34.0s), 050/100 VUs, 2030 complete and 0 interrupted iterations
default   [  55% ] 050/100 VUs  1m34.0s/2m50.0s

running (1m35.0s), 050/100 VUs, 2080 complete and 0 interrupted iterations
default   [  56% ] 050/100 VUs  1m35.0s/2m50.0s

running (1m36.0s), 050/100 VUs, 2130 complete and 0 interrupted iterations
default   [  56% ] 050/100 VUs  1m36.0s/2m50.0s

running (1m37.0s), 050/100 VUs, 2180 complete and 0 interrupted iterations
default   [  57% ] 050/100 VUs  1m37.0s/2m50.0s

running (1m38.0s), 050/100 VUs, 2230 complete and 0 interrupted iterations
default   [  58% ] 050/100 VUs  1m38.0s/2m50.0s

running (1m39.0s), 050/100 VUs, 2280 complete and 0 interrupted iterations
default   [  58% ] 050/100 VUs  1m39.0s/2m50.0s

running (1m40.0s), 050/100 VUs, 2330 complete and 0 interrupted iterations
default   [  59% ] 050/100 VUs  1m40.0s/2m50.0s

running (1m41.0s), 052/100 VUs, 2380 complete and 0 interrupted iterations
default   [  59% ] 052/100 VUs  1m41.0s/2m50.0s

running (1m42.0s), 054/100 VUs, 2432 complete and 0 interrupted iterations
default   [  60% ] 054/100 VUs  1m42.0s/2m50.0s

running (1m43.0s), 057/100 VUs, 2486 complete and 0 interrupted iterations
default   [  61% ] 057/100 VUs  1m43.0s/2m50.0s

running (1m44.0s), 059/100 VUs, 2538 complete and 0 interrupted iterations
default   [  61% ] 059/100 VUs  1m44.0s/2m50.0s

running (1m45.0s), 062/100 VUs, 2586 complete and 0 interrupted iterations
default   [  62% ] 062/100 VUs  1m45.0s/2m50.0s

running (1m46.0s), 064/100 VUs, 2639 complete and 0 interrupted iterations
default   [  62% ] 064/100 VUs  1m46.0s/2m50.0s

running (1m47.0s), 067/100 VUs, 2692 complete and 0 interrupted iterations
default   [  63% ] 067/100 VUs  1m47.0s/2m50.0s

running (1m48.0s), 069/100 VUs, 2749 complete and 0 interrupted iterations
default   [  64% ] 069/100 VUs  1m48.0s/2m50.0s

running (1m49.0s), 072/100 VUs, 2811 complete and 0 interrupted iterations
default   [  64% ] 072/100 VUs  1m49.0s/2m50.0s

running (1m50.0s), 074/100 VUs, 2883 complete and 0 interrupted iterations
default   [  65% ] 074/100 VUs  1m50.0s/2m50.0s

running (1m51.0s), 077/100 VUs, 2956 complete and 0 interrupted iterations
default   [  65% ] 077/100 VUs  1m51.0s/2m50.0s

running (1m52.0s), 079/100 VUs, 3033 complete and 0 interrupted iterations
default   [  66% ] 079/100 VUs  1m52.0s/2m50.0s

running (1m53.0s), 082/100 VUs, 3112 complete and 0 interrupted iterations
default   [  66% ] 082/100 VUs  1m53.0s/2m50.0s

running (1m54.0s), 084/100 VUs, 3193 complete and 0 interrupted iterations
default   [  67% ] 084/100 VUs  1m54.0s/2m50.0s

running (1m55.0s), 087/100 VUs, 3277 complete and 0 interrupted iterations
default   [  68% ] 087/100 VUs  1m55.0s/2m50.0s

running (1m56.0s), 089/100 VUs, 3361 complete and 0 interrupted iterations
default   [  68% ] 089/100 VUs  1m56.0s/2m50.0s

running (1m57.0s), 092/100 VUs, 3450 complete and 0 interrupted iterations
default   [  69% ] 092/100 VUs  1m57.0s/2m50.0s

running (1m58.0s), 094/100 VUs, 3541 complete and 0 interrupted iterations
default   [  69% ] 094/100 VUs  1m58.0s/2m50.0s

running (1m59.0s), 097/100 VUs, 3635 complete and 0 interrupted iterations
default   [  70% ] 097/100 VUs  1m59.0s/2m50.0s

running (2m00.0s), 099/100 VUs, 3730 complete and 0 interrupted iterations
default   [  71% ] 099/100 VUs  2m00.0s/2m50.0s

running (2m01.0s), 100/100 VUs, 3817 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  2m01.0s/2m50.0s

running (2m02.0s), 100/100 VUs, 3909 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m02.0s/2m50.0s

running (2m03.0s), 100/100 VUs, 3999 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m03.0s/2m50.0s

running (2m04.0s), 100/100 VUs, 4091 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  2m04.0s/2m50.0s

running (2m05.0s), 100/100 VUs, 4181 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  2m05.0s/2m50.0s

running (2m06.0s), 100/100 VUs, 4268 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  2m06.0s/2m50.0s

running (2m07.0s), 100/100 VUs, 4356 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  2m07.0s/2m50.0s

running (2m08.0s), 100/100 VUs, 4448 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  2m08.0s/2m50.0s

running (2m09.0s), 100/100 VUs, 4548 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  2m09.0s/2m50.0s

running (2m10.0s), 100/100 VUs, 4648 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  2m10.0s/2m50.0s

running (2m11.0s), 100/100 VUs, 4748 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  2m11.0s/2m50.0s

running (2m12.0s), 100/100 VUs, 4848 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  2m12.0s/2m50.0s

running (2m13.0s), 100/100 VUs, 4948 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  2m13.0s/2m50.0s

running (2m14.0s), 100/100 VUs, 5048 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  2m14.0s/2m50.0s

running (2m15.0s), 100/100 VUs, 5146 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  2m15.0s/2m50.0s

running (2m16.0s), 100/100 VUs, 5235 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  2m16.0s/2m50.0s

running (2m17.0s), 100/100 VUs, 5323 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  2m17.0s/2m50.0s

running (2m18.0s), 100/100 VUs, 5408 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  2m18.0s/2m50.0s

running (2m19.0s), 100/100 VUs, 5496 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  2m19.0s/2m50.0s

running (2m20.0s), 100/100 VUs, 5585 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  2m20.0s/2m50.0s

running (2m21.0s), 100/100 VUs, 5674 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  2m21.0s/2m50.0s

running (2m22.0s), 100/100 VUs, 5758 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  2m22.0s/2m50.0s

running (2m23.0s), 100/100 VUs, 5848 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  2m23.0s/2m50.0s

running (2m24.0s), 100/100 VUs, 5948 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  2m24.0s/2m50.0s

running (2m25.0s), 100/100 VUs, 6048 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  2m25.0s/2m50.0s

running (2m26.0s), 100/100 VUs, 6148 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  2m26.0s/2m50.0s

running (2m27.0s), 100/100 VUs, 6248 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  2m27.0s/2m50.0s

running (2m28.0s), 100/100 VUs, 6348 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  2m28.0s/2m50.0s

running (2m29.0s), 100/100 VUs, 6448 complete and 0 interrupted iterations
default   [  88% ] 100/100 VUs  2m29.0s/2m50.0s

running (2m30.0s), 100/100 VUs, 6548 complete and 0 interrupted iterations
default   [  88% ] 100/100 VUs  2m30.0s/2m50.0s

running (2m31.0s), 097/100 VUs, 6640 complete and 0 interrupted iterations
default   [  89% ] 097/100 VUs  2m31.0s/2m50.0s

running (2m32.0s), 092/100 VUs, 6727 complete and 0 interrupted iterations
default   [  89% ] 092/100 VUs  2m32.0s/2m50.0s

running (2m33.0s), 090/100 VUs, 6809 complete and 0 interrupted iterations
default   [  90% ] 090/100 VUs  2m33.0s/2m50.0s

running (2m34.0s), 084/100 VUs, 6888 complete and 0 interrupted iterations
default   [  91% ] 084/100 VUs  2m34.0s/2m50.0s

running (2m35.0s), 079/100 VUs, 6959 complete and 0 interrupted iterations
default   [  91% ] 079/100 VUs  2m35.0s/2m50.0s

running (2m36.0s), 075/100 VUs, 7029 complete and 0 interrupted iterations
default   [  92% ] 075/100 VUs  2m36.0s/2m50.0s

running (2m37.0s), 069/100 VUs, 7093 complete and 0 interrupted iterations
default   [  92% ] 069/100 VUs  2m37.0s/2m50.0s

running (2m38.0s), 065/100 VUs, 7151 complete and 0 interrupted iterations
default   [  93% ] 065/100 VUs  2m38.0s/2m50.0s

running (2m39.0s), 059/100 VUs, 7211 complete and 0 interrupted iterations
default   [  94% ] 059/100 VUs  2m39.0s/2m50.0s

running (2m40.0s), 054/100 VUs, 7270 complete and 0 interrupted iterations
default   [  94% ] 054/100 VUs  2m40.0s/2m50.0s

running (2m41.0s), 049/100 VUs, 7324 complete and 0 interrupted iterations
default   [  95% ] 049/100 VUs  2m41.0s/2m50.0s

running (2m42.0s), 043/100 VUs, 7373 complete and 0 interrupted iterations
default   [  95% ] 043/100 VUs  2m42.0s/2m50.0s

running (2m43.0s), 039/100 VUs, 7416 complete and 0 interrupted iterations
default   [  96% ] 039/100 VUs  2m43.0s/2m50.0s

running (2m44.0s), 033/100 VUs, 7455 complete and 0 interrupted iterations
default   [  96% ] 033/100 VUs  2m44.0s/2m50.0s

running (2m45.0s), 028/100 VUs, 7488 complete and 0 interrupted iterations
default   [  97% ] 028/100 VUs  2m45.0s/2m50.0s

running (2m46.0s), 022/100 VUs, 7516 complete and 0 interrupted iterations
default   [  98% ] 022/100 VUs  2m46.0s/2m50.0s

running (2m47.0s), 018/100 VUs, 7538 complete and 0 interrupted iterations
default   [  98% ] 018/100 VUs  2m47.0s/2m50.0s

running (2m48.0s), 012/100 VUs, 7556 complete and 0 interrupted iterations
default   [  99% ] 012/100 VUs  2m48.0s/2m50.0s

running (2m49.0s), 007/100 VUs, 7568 complete and 0 interrupted iterations
default   [  99% ] 007/100 VUs  2m49.0s/2m50.0s

running (2m50.0s), 002/100 VUs, 7575 complete and 0 interrupted iterations
default   [ 100% ] 002/100 VUs  2m50.0s/2m50.0s


  █ TOTAL RESULTS 

    checks_total.......: 7577    44.344707/s
    checks_succeeded...: 100.00% 7577 out of 7577
    checks_failed......: 0.00%   0 out of 7577

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=60.99ms min=21.11ms med=61.39ms max=195.95ms p(90)=78.49ms p(95)=86.13ms
      { expected_response:true }...: avg=60.99ms min=21.11ms med=61.39ms max=195.95ms p(90)=78.49ms p(95)=86.13ms
    http_req_failed................: 0.00%  0 out of 7577
    http_reqs......................: 7577   44.344707/s

    EXECUTION
    iteration_duration.............: avg=1.06s   min=1.02s   med=1.06s   max=1.19s    p(90)=1.07s   p(95)=1.08s  
    iterations.....................: 7577   44.344707/s
    vus............................: 2      min=1         max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 608 MB 3.6 MB/s
    data_sent......................: 2.2 MB 13 kB/s



running (2m50.9s), 000/100 VUs, 7577 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  2m50s